Restaurant/app/controllers/cart_controller.rb

  def index
    @cart = Cart.all
---
SELECT "carts".* FROM "carts"

  def show
    render json: Cart.find_by(user_id:params[:id]).cart_items
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]