Restaurant/app/controllers/restaurant_detail_controller.rb

  def index
   @restaurant =  RestaurantDetail.all
---
SELECT "restaurant_details".* FROM "restaurant_details"

  def show
    if rest = RestaurantDetail.find_by(id:params[:id])
---
SELECT "restaurant_details".* FROM "restaurant_details" WHERE "restaurant_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]