Restaurant/app/controllers/user_controller.rb

  def create
    @user = User.create(user_signup_params)
---
INSERT INTO "users" ("id", "name", "address", "city_id", "contact", "email", "password", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def login
    @user = user_signin_params
    if user = User.find_by(email:@user["email"], password:@user["password"])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "vonda@gmail.com"], ["password", "[FILTERED]"], ["LIMIT", 1]]