Restaurant/app/models/restaurant_detail.rb

SELECT COUNT(*) AS "count_all", "menus"."restaurant_detail_id" AS "menus_restaurant_detail_id" FROM "menus" WHERE (rating =5) GROUP BY "menus"."restaurant_detail_id"
SELECT COUNT(*) FROM "menus" WHERE "menus"."restaurant_detail_id" = $1  [["restaurant_detail_id", 1]]
SELECT "restaurant_details".* FROM "restaurant_details" WHERE "restaurant_details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def max_avg_rating
    restaurants = []
    restaurant_5Stars = Menu.group(:restaurant_detail_id).where('rating =?',5).count
    restaurant_5Stars.each{|key,val|
    if val > 0.5 * Menu.where(restaurant_detail_id:key).count
        restaurants.push([id:key,name:RestaurantDetail.find(key).name,max_star_count:val])